Revit 2026 API

# FabricHostReference Enumeration

---

Controls if Single Fabric Sheet should be cut by the Host Cover.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricHostReference
```
```vb
Public Enumeration FabricHostReference
```
```cpp
public enum class FabricHostReference
```
```fsharp
type FabricHostReference
```

| Member name | Value | Description |
| --- | --- | --- |
| CutByCover | 1 | The fabric is cut by the host cover. |
| NotCutByCover | 0 | The fabric is not cut by the host cover. |

#### Reference

Autodesk.Revit.DB.Structure Namespace